// 1. Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.
document.write("1. Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом. </br></br>");
const a = ['a', 'b', 'c'];
const b = [1, 2, 3];

document.write(a.concat(b) + "</br> </br>");

// 2. Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.
document.write("2. Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3. </br></br>");
const c = ['a', 'b', 'c'];
c.push(1, 2, 3);

document.write(c + "</br> </br>");

// Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].
document.write("3.Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1]. </br></br>");
const d = [1, 2, 3];
d.reverse();

document.write(d + "</br> </br>");

// Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.
document.write("4. Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6. </br></br>");
const e = [1, 2, 3];
e.push(4, 5, 6);

document.write(e + "</br> </br>");

// Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.
document.write("5. Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6. </br></br>");
const f = [1, 2, 3];
f.unshift(4, 5, 6);

document.write(f + "</br> </br>");


// Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.
document.write("6. Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран. </br></br>");
const g = ['js', 'css', 'jq'];

document.write(g[0] + "</br> </br>");

// Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3].
document.write("7. Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3]. </br></br>");
const h = [1, 2, 3, 4, 5];
let i = h.slice(0, 3)

document.write(i + "</br> </br>");

// Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].
document.write("8. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5]. </br></br>");
const j = [1, 2, 3, 4, 5];
j.splice(1, 2)

document.write(j + "</br> </br>");

// Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].
document.write("9. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5]. </br></br>");
const k = [1, 2, 3, 4, 5];
k.splice(2, 0, 10)

document.write(k + "</br> </br>");

// Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.
document.write("10. Дан масив [3, 4, 1, 2, 7]. Відсортуйте його. </br></br>");
const l = [3, 4, 1, 2, 7];
l.sort()

document.write(l + "</br> </br>");

// Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'.
document.write("11. Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'. </br></br>");
const m = ['Привіт, ', 'світ', '!'];

document.write(m.join("") + "</br> </br>");

// Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, ' (тобто замість слова 'Привіт, ' буде 'Поки, ').
document.write("12. Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, ' (тобто замість слова 'Привіт, ' буде 'Поки, '). </br></br>");
const n = ['Привіт, ', 'світ', '!'];
n[0] = "Поки ";

document.write(n + "</br> </br>");


// Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.
document.write("13. Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами. </br></br>");
const arr = [1, 2, 3, 4, 5];
const arr1 = new Array(1, 2, 3, 4, 5);

document.write(arr + "</br>" + arr1 + "</br> </br>");

// Дан багатовимірний масив arr. Виведіть за його допомогою слово 'блакитний' 'blue' 
document.write("14. Дан багатовимірний масив arr. Виведіть за його допомогою слово 'блакитний' 'blue'  </br></br>");
var arr3 = {
    'ru': ['блакитний', 'червоний', 'зелений'],
    'en': ['blue', 'red', 'green'],
};

document.write(arr3.ru[0] + " " + arr3.en[0] + "</br> </br>");

// Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.
document.write("15. Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'. </br></br>");
const arr4 = ['a', 'b', 'c', 'd'];

document.write(arr4[0] + "+" + arr4[1] + "," + " " + arr4[2] + "+" + arr4[3] + "</br> </br>");

// Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, яку передав користувач. у кожному індексі масиву зберігайте чило який показуватиме номер елемента масиву.
document.write("16. Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, яку передав користувач. у кожному індексі масиву зберігайте чило який показуватиме номер елемента масиву. </br></br>");
let count = parseInt(prompt("Введіть кількість користувачів", ""));
const arr5 = new Array(count);
for (let i = 0; i < arr5.length; i++) {
    arr5[i] = i + 1;
}

document.write(arr5 + "</br> </br>");

// Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом.
document.write("17. Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом. </br></br>");
for (let i = 0; i < arr5.length; i++) {
    if (arr5[i] % 2 === 1) {
        document.write("<p>" + arr5[i] + "</p>");
    } else {
        document.write(`<span style="background: red;">` + arr5[i] + `</span>`);
    };
}

document.write("</br> </br>");

// Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою.
document.write("18. Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою. </br></br>");
var vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морковка'];
let str = vegetables.join(", ")

document.write(str + "</br> </br>");